/*
Задача 64: Задайте значение N. Напишите программу, которая выведет 
все натуральные числа в промежутке от N до 1. Выполнить с помощью рекурсии.
N = 5 -> "5, 4, 3, 2, 1"
N = 8 -> "8, 7, 6, 5, 4, 3, 2, 1"
*/
int GetNaturalNumber(string message)
{
  int result = 0;

  while (true)
  {
    Console.Write(message);

    if (int.TryParse(Console.ReadLine(), out result) && result > 0)
    {
      break;
    }
    else
    {
      Console.WriteLine("Ввели не число или некорректное число. Повторите ввод!");
    }
  }

  return result;
}

void PrintNumber(int N, int i)
{
  if (i > N)
  {
    return;
  }
  else
  {
    PrintNumber(N, i+1);
    Console.Write(i+ "");
  }
}

Console.WriteLine();
int i = 1;
int numbers = GetNaturalNumber("Введите натуральное число: ");
PrintNumber(numbers, i);